Você é responsável por criar um banco de dados local de clientes para uma instituição financeira. Temos o arquivo CSV com os dados de clientes.


Sua missão é:


1. Criar o banco de dados local com a biblioteca SQLAlchemy.
2. Escrever os dados do arquivo CSV neste banco de dados local.
3. Realizar três atualizações no banco de dados:
    1. Atualizar o registro do cliente de ID 6840104 que teve o rendimento anual alterado para 300000.
    2. Excluir o registro do cliente de ID 5008809, pois essa pessoa não possui mais conta na instituição financeira.
    3. Criar um novo registro de cliente seguindo as especificações abaixo:
        - ID_Cliente: 6850985
        - Idade: 33
        - Grau_escolaridade: Doutorado
        - Estado_civil: Solteiro
        - Tamanho_familia: 1
        - Categoria_de_renda: Empregado
        - Ocupacao: TI
        - Anos_empregado: 2
        - Rendimento_anual: 290000
        - Tem_carro: 0
        - Moradia: Casa/apartamento próprio
    
    >Dica importante: Para adicionar um(a) novo(a) cliente à tabela, utilize a cláusula INSERT INTO seguida do nome da tabela e depois especifique entre parênteses os nomes das colunas da tabela. Utilize a cláusula VALUES e, em seguida, passe entre parênteses os novos valores para esse novo registro. Certifique-se de que os valores estejam na ordem correta e no formato adequado para cada coluna.

In [25]:
from sqlalchemy import create_engine
import pandas as pd

In [26]:
# Criar o banco de dados local com a biblioteca SQLAlchemy.
engine = create_engine('sqlite:///base.db')

In [27]:
url = 'https://raw.githubusercontent.com/alura-cursos/Pandas/main/clientes_banco.csv'

In [29]:
# Realizamos una consulta para ver los datos actuales
clientes_banco = pd.read_csv(url)
clientes_banco.query('ID_Cliente == 6840104')

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
438458,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,135000.0,0,Casa/apartamento próprio

In [30]:
# Escrever os dados do arquivo CSV neste banco de dados local.
clientes_banco.to_sql('clientes', engine, index=False)

438463

In [31]:
pd.read_sql_table('clientes', engine).shape

(438463, 11)

In [32]:
# Atualizar o registro do cliente de ID 6840104 que teve o rendimento anual alterado para 300000.
query = 'UPDATE clientes SET Rendimento_anual = 300000 WHERE ID_Cliente = 6840104'

In [33]:
from sqlalchemy import text

with engine.connect() as conn:
    conn.execute(text(query))
    conn.commit()

In [34]:
# Consultamos el usuario para verificar que se actualizaron los datos
pd.read_sql_table('clientes', engine).query('ID_Cliente == 6840104')

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
438458,6840104,62,Ensino médio,Divorciado,1,Pensionista,Outro,0,300000.0,0,Casa/apartamento próprio

In [35]:
# Excluir o registro do cliente de ID 5008809, pois essa pessoa não possui mais conta na instituição financeira.

In [36]:
# Realizamos una consutla antes para ver los datos del cliente
pd.read_sql_table('clientes', engine).query('ID_Cliente == 5008809')

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
4,5008809,52,Ensino médio,Solteiro,1,Associado comercial,Vendas,8,270000.0,0,Casa/apartamento próprio

In [37]:
query3 = 'DELETE FROM clientes WHERE ID_Cliente = 5008809'
with engine.connect() as conn:
    conn.execute(text(query3))
    conn.commit()

In [38]:
#Consultamos si fue borrado el cliente del banco de datos
pd.read_sql_table('clientes', engine).query('ID_Cliente == 5008809')

Empty DataFrame
Columns: [ID_Cliente, Idade, Grau_escolaridade, Estado_civil, Tamanho_familia, Categoria_de_renda, Ocupacao, Anos_empregado, Rendimento_anual, Tem_carro, Moradia]
Index: []

In [43]:
# Crear consulta para nuevo registro.
query4 = 'INSERT INTO clientes (ID_Cliente,Idade,Grau_escolaridade, Estado_civil, Tamanho_familia, Categoria_de_renda, Ocupacao, Anos_empregado, Rendimento_anual, Tem_carro, Moradia) VALUES (6850985, 33,"Doutorado", "Solteiro", 1, "Empregado","TI", 2, 290000, 0, "Casa/apartamento próprio")'

In [44]:
#Cargar registro a la base de datos
with engine.connect() as conn:
    conn.execute(text(query4))
    conn.commit()

In [45]:
pd.read_sql_table('clientes', engine).query('ID_Cliente == 6850985')

,ID_Cliente,Idade,Grau_escolaridade,Estado_civil,Tamanho_familia,Categoria_de_renda,Ocupacao,Anos_empregado,Rendimento_anual,Tem_carro,Moradia
438462,6850985,33,Doutorado,Solteiro,1,Empregado,TI,2,290000.0,0,Casa/apartamento próprio